# NewRooms2 Method (Level)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewRooms2 Method (Level)
Document Class See Also
---
Creates new rooms in each plan circuit found in the given level in the last phase.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> NewRooms2(
	Level level
)
```

Visual Basic
---
```text
Public Function NewRooms2 ( _
	level As Level _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ NewRooms2(
	Level^ level
)
```

# ### Parameters
level
    Type: Autodesk.Revit.DB..::..Level The level from which the circuits are found.
# ### Return Value
If successful, a set of ElementIds which contains the rooms created should be returned, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | If the view of the relevant level can not be retrieved. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If the phase is invalid, or regeneration fails at the end of the creation. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the level does not exist in the given document. |

# See Also
Document Class
NewRooms2 Overload
Autodesk.Revit.Creation Namespace